#ifndef DATA_HPP 
#define DATA_HPP

const int ANIME_SIZE = 170;
const int ANIME_WIDTH = 1;
const char ANIME_CHARS[ANIME_SIZE][4] = {
    "ネ", "キ", "ビ", "る", "ョ", "ブ", "た", "タ", "ず", "ぞ",
    "ト", "ふ", "ね", "ゲ", "エ", "グ", "ナ", "ル", "ヸ", "ゅ",
    "ぁ", "や", "て", "ペ", "プ", "ぼ", "カ", "で", "ソ", "ボ",
    "ホ", "げ", "め", "ヮ", "ェ", "ぴ", "ヤ", "べ", "ア", "わ",
    "ぶ", "へ", "え", "チ", "つ", "ゞ", "し", "ヌ", "さ", "ゾ",
    "ハ", "な", "ゟ", "ゐ", "ぽ", "メ", "ぺ", "き", "ダ", "サ",
    "ユ", "セ", "を", "ヨ", "の", "ぐ", "レ", "ケ", "だ", "ラ",
    "ャ", "ぱ", "う", "ヘ", "そ", "ヶ", "ワ", "ピ", "モ", "っ",
    "ム", "イ", "ぢ", "ク", "ゥ", "ヹ", "く", "ド", "ろ", "ぎ",
    "ベ", "ほ", "む", "ズ", "こ", "ゆ", "ォ", "ょ", "ァ", "ヲ",
    "ギ", "ゑ", "よ", "ポ", "い", "は", "ゖ", "か", "ス", "バ",
    "じ", "に", "ゕ", "け", "ィ", "づ", "ヰ", "ゃ", "ュ", "ゎ",
    "せ", "ウ", "ヵ", "オ", "ヺ", "が", "ど", "ヱ", "び", "ヾ",
    "ん", "ゔ", "ざ", "フ", "ヂ", "テ", "ミ", "デ", "ら", "ぇ",
    "あ", "パ", "ま", "ガ", "ザ", "ン", "ひ", "れ", "ゝ", "お",
    "ヴ", "み", "と", "マ", "ご", "ぅ", "ぬ", "ヒ", "ば", "ち",
    "ぷ", "す", "リ", "り", "ゼ", "ぜ", "ヷ", "ぉ", "ぃ", "も"
};

const int ASCII_SIZE = 94;
const int ASCII_WIDTH = 0;
const char ASCII_CHARS[ASCII_SIZE][4] = {
    "a", "b", "c", "d", "e", "f", "g", "h", "i", "j",
    "k", "l", "m", "n", "o", "p", "q", "r", "s", "t",
    "u", "v", "w", "x", "y", "z", "A", "B", "C", "D",
    "E", "F", "G", "H", "I", "J", "K", "L", "M", "N",
    "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X",
    "Y", "Z", "`", "1", "2", "3", "4", "5", "6", "7",
    "8", "9", "0", "-", "=", "[", "]", ";", "'", ",",
    ".", "/", "~", "!", "@", "#", "$", "%", "^", "&",
    "*", "(", ")", "_", "+", "{", "}", "|", ":", "<",
    ">", "?", "\\", "\"", 
};

#endif

