#ifndef DATA_HPP 
#define DATA_HPP

const int ANIME_SIZE = 170;
const int ANIME_WIDTH = 1;
const char ANIME_CHARS[ANIME_SIZE][4] = {
    "ネ", "キ", "ビ", "る", "ョ", "ブ", "た", "タ", "ず", "ぞ",
    "ト", "ふ", "ね", "ゲ", "エ", "グ", "ナ", "ル", "ヸ", "ゅ",
    "ぁ", "や", "て", "ペ", "プ", "ぼ", "カ", "で", "ソ", "ボ",
    "ホ", "げ", "め", "ヮ", "ェ", "ぴ", "ヤ", "べ", "ア", "わ",
    "ぶ", "へ", "え", "チ", "つ", "ゞ", "し", "ヌ", "さ", "ゾ",
    "ハ", "な", "ゟ", "ゐ", "ぽ", "メ", "ぺ", "き", "ダ", "サ",
    "ユ", "セ", "を", "ヨ", "の", "ぐ", "レ", "ケ", "だ", "ラ",
    "ャ", "ぱ", "う", "ヘ", "そ", "ヶ", "ワ", "ピ", "モ", "っ",
    "ム", "イ", "ぢ", "ク", "ゥ", "ヹ", "く", "ド", "ろ", "ぎ",
    "ベ", "ほ", "む", "ズ", "こ", "ゆ", "ォ", "ょ", "ァ", "ヲ",
    "ギ", "ゑ", "よ", "ポ", "い", "は", "ゖ", "か", "ス", "バ",
    "じ", "に", "ゕ", "け", "ィ", "づ", "ヰ", "ゃ", "ュ", "ゎ",
    "せ", "ウ", "ヵ", "オ", "ヺ", "が", "ど", "ヱ", "び", "ヾ",
    "ん", "ゔ", "ざ", "フ", "ヂ", "テ", "ミ", "デ", "ら", "ぇ",
    "あ", "パ", "ま", "ガ", "ザ", "ン", "ひ", "れ", "ゝ", "お",
    "ヴ", "み", "と", "マ", "ご", "ぅ", "ぬ", "ヒ", "ば", "ち",
    "ぷ", "す", "リ", "り", "ゼ", "ぜ", "ヷ", "ぉ", "ぃ", "も"
};

const int ASCII_SIZE = 85;
const int ASCII_WIDTH = 0;
const char ASCII_CHARS[ASCII_SIZE][4] = {
    "G", "M", "Y", "N", "h", "@", "Q", "0",
    ")", "x", "4", "[", "2", "q", "B", "X", "6", "R",
    "%", "C", "k", "w", "K", "g", "I", "v", "u", "1",
    "d", "L", "Z", "|", "S", "J", "r", "n",
    "F", "!", "b", "A", "*", "s", "#", "+", "t", "y",
    "=", "]", "z", "7", "j", "f", "i", "<", "D", "E",
    "(", ">", "V", "-", "H", "p", ";", "{",
    "m", "/", "$", "c", "9", "l", "5", "P", "W",
    "a", "T", "O", "U", "}", "&", "e", "8", "o",
    "?", "3", "\\"
};

#endif
